In [1]:
import pandas as pd
import numpy as np
from pandas import DataFrame, Series

In [9]:
dframe = DataFrame({'k1':['X','X','Y','Y','Z'],
                   'k2':['alpha','beta','alpha','beta','alpha'],
                   'dataset1':np.random.randn(5),
                   'dataset2':np.random.randn(5)})

In [10]:
dframe

  k1     k2  dataset1  dataset2
0  X  alpha  0.161155 -0.438665
1  X   beta  1.146500  1.494404
2  Y  alpha  0.772734  1.000251
3  Y   beta -0.453263 -0.235085
4  Z  alpha -0.799806  0.270591

In [12]:
group1 = dframe['dataset1'].groupby(dframe['k1'])

In [13]:
group1

In [15]:
group1.mean()

k1
X    0.653827
Y    0.159736
Z   -0.799806
Name: dataset1, dtype: float64

In [16]:
cities = np.array(['btm','dmk','dmk','ntm','btm'])

month = np.array(['jan','feb','jan','feb','jan'])

In [17]:
dframe['dataset1'].groupby([cities,month]).mean()

btm  jan   -0.319326
dmk  feb    1.146500
     jan    0.772734
ntm  feb   -0.453263
Name: dataset1, dtype: float64

In [18]:
dframe

  k1     k2  dataset1  dataset2
0  X  alpha  0.161155 -0.438665
1  X   beta  1.146500  1.494404
2  Y  alpha  0.772734  1.000251
3  Y   beta -0.453263 -0.235085
4  Z  alpha -0.799806  0.270591

In [19]:
dframe.groupby('k1').mean()

    dataset1  dataset2
k1
X   0.653827  0.527870
Y   0.159736  0.382583
Z  -0.799806  0.270591

In [21]:
dframe.groupby(['k1','k2']).mean()

          dataset1  dataset2
k1 k2
X  alpha  0.161155 -0.438665
   beta   1.146500  1.494404
Y  alpha  0.772734  1.000251
   beta  -0.453263 -0.235085
Z  alpha -0.799806  0.270591

In [22]:
dframe.groupby(['k1']).size()

k1
X    2
Y    2
Z    1
dtype: int64

In [23]:
dframe

  k1     k2  dataset1  dataset2
0  X  alpha  0.161155 -0.438665
1  X   beta  1.146500  1.494404
2  Y  alpha  0.772734  1.000251
3  Y   beta -0.453263 -0.235085
4  Z  alpha -0.799806  0.270591

In [28]:
for name,group in dframe.groupby('k1'):
    print("this is the %s group" %name)
    print (group)
    print ('\n')

this is the X group
  k1     k2  dataset1  dataset2
0  X  alpha  0.161155 -0.438665
1  X   beta  1.146500  1.494404


this is the Y group
  k1     k2  dataset1  dataset2
2  Y  alpha  0.772734  1.000251
3  Y   beta -0.453263 -0.235085


this is the Z group
  k1     k2  dataset1  dataset2
4  Z  alpha -0.799806  0.270591

In [34]:
for (k1,k2), group in dframe.groupby(['k1','k2']):
    print ("key1 = %s key2 =%s" %(k1,k2))
    print (group)
    print ('\n')

key1 = X key2 =alpha
  k1     k2  dataset1  dataset2
0  X  alpha  0.161155 -0.438665


key1 = X key2 =beta
  k1    k2  dataset1  dataset2
1  X  beta    1.1465  1.494404


key1 = Y key2 =alpha
  k1     k2  dataset1  dataset2
2  Y  alpha  0.772734  1.000251


key1 = Y key2 =beta
  k1    k2  dataset1  dataset2
3  Y  beta -0.453263 -0.235085


key1 = Z key2 =alpha
  k1     k2  dataset1  dataset2
4  Z  alpha -0.799806  0.270591

In [33]:
dframe

  k1     k2  dataset1  dataset2
0  X  alpha  0.161155 -0.438665
1  X   beta  1.146500  1.494404
2  Y  alpha  0.772734  1.000251
3  Y   beta -0.453263 -0.235085
4  Z  alpha -0.799806  0.270591

In [37]:
group_dict = dict(list(dframe.groupby('k1')))

In [39]:
group_dict['X']

  k1     k2  dataset1  dataset2
0  X  alpha  0.161155 -0.438665
1  X   beta  1.146500  1.494404

In [45]:
group_dict_axis1 = dict(list(dframe.groupby(dframe.dtypes,axis=1)))

In [46]:
group_dict_axis1

{dtype('float64'):    dataset1  dataset2
 0  0.161155 -0.438665
 1  1.146500  1.494404
 2  0.772734  1.000251
 3 -0.453263 -0.235085
 4 -0.799806  0.270591, dtype('O'):   k1     k2
 0  X  alpha
 1  X   beta
 2  Y  alpha
 3  Y   beta
 4  Z  alpha}

In [47]:
dataset2_group = dframe.groupby(['k1','k2'])[['dataset2']]
dataset2_group.mean()

          dataset2
k1 k2
X  alpha -0.438665
   beta   1.494404
Y  alpha  1.000251
   beta  -0.235085
Z  alpha  0.270591